{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Model", "config": {"name": "homography_net", "input_layers": [["patch", 0, 0]], "layers": [{"name": "patch", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "patch", "batch_input_shape": [null, 128, 128, 2], "sparse": false, "dtype": "float32"}}, {"name": "conv1_1", "class_name": "Conv2D", "inbound_nodes": [[["patch", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv1_1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 64, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["conv1_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "beta_constraint": null}}, {"name": "conv1_2", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv1_2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 64, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "beta_constraint": null}}, {"name": "pool1", "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "pool1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"name": "conv2_1", "class_name": "Conv2D", "inbound_nodes": [[["pool1", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv2_1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 64, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["conv2_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "beta_constraint": null}}, {"name": "conv2_2", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv2_2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 64, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "beta_constraint": null}}, {"name": "pool2", "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "pool2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"name": "conv3_1", "class_name": "Conv2D", "inbound_nodes": [[["pool2", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv3_1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 128, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["conv3_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "beta_constraint": null}}, {"name": "conv3_2", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv3_2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 128, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["conv3_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "beta_constraint": null}}, {"name": "pool3", "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "pool3", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"name": "conv4_1", "class_name": "Conv2D", "inbound_nodes": [[["pool3", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv4_1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 128, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["conv4_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "beta_constraint": null}}, {"name": "conv4_2", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv4_2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 128, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_2", 0, 0, {}]]], "config": {"name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "beta_constraint": null}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "dense_1", "units": 1024, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"activation": "linear", "name": "dense_2", "units": 8, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null}}], "output_layers": [["dense_2", 0, 0]]}}